In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj=Series(['c','a','d','a','a','b','b','c','c'])

In [3]:
uniques = obj.unique()

In [4]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [5]:
uniques.sort()

In [6]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [9]:
obj.value_counts(ascending=True)

d    1
b    2
a    3
c    3
dtype: int64

In [10]:
pd.value_counts(obj.values,sort=False)

b    2
a    3
c    3
d    1
dtype: int64

In [13]:
mask = obj.isin(['b','c'])

In [14]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [16]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [17]:
data = DataFrame({'Qu1':[1,3,4,3,4],
                 'Qu2':[2,3,1,2,3],
                 'Qu3':[1,5,2,4,4]})

In [18]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [27]:
result = data.apply(pd.value_counts).fillna(0)

In [28]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# 处理缺失数据

In [29]:
string_data = Series(['arrdvark','artichoke',np.nan,'avocado'])

In [30]:
string_data

0     arrdvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [31]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [32]:
string_data[0]=None

In [33]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [34]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

# 滤除缺失数据

In [35]:
from numpy import nan as NA

In [36]:
data = Series([1,NA,3.5,NA,7])

In [37]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [38]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [39]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [40]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [41]:
data = DataFrame([[1,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [42]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [43]:
cleaned = data.dropna()   #只要含有NaN的行就会被删除

In [44]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [45]:
cleaned = data.dropna(how='all')    #全部都是NaN的行才会删除（行列切换，只要对axis赋值）

In [46]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [48]:
df = DataFrame(np.random.randn(7,3))

In [49]:
df

          0         1         2
0  1.034041  0.671358  0.887861
1 -0.503624  0.042733  0.670947
2 -0.286119  1.609754 -2.060536
3 -0.935605  0.207252  0.221601
4  0.960638  0.551470  0.385240
5 -0.150610 -0.471551 -1.108601
6 -0.323696 -0.889597  0.590986

In [50]:
df.ix[:4,1]=NA;df.ix[:2,2]=NA

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [51]:
df

          0         1         2
0  1.034041       NaN       NaN
1 -0.503624       NaN       NaN
2 -0.286119       NaN       NaN
3 -0.935605       NaN  0.221601
4  0.960638       NaN  0.385240
5 -0.150610 -0.471551 -1.108601
6 -0.323696 -0.889597  0.590986

In [55]:
df.dropna(thresh=1)

          0         1         2
0  1.034041       NaN       NaN
1 -0.503624       NaN       NaN
2 -0.286119       NaN       NaN
3 -0.935605       NaN  0.221601
4  0.960638       NaN  0.385240
5 -0.150610 -0.471551 -1.108601
6 -0.323696 -0.889597  0.590986

In [56]:
df.fillna(0)

          0         1         2
0  1.034041  0.000000  0.000000
1 -0.503624  0.000000  0.000000
2 -0.286119  0.000000  0.000000
3 -0.935605  0.000000  0.221601
4  0.960638  0.000000  0.385240
5 -0.150610 -0.471551 -1.108601
6 -0.323696 -0.889597  0.590986

In [57]:
df

          0         1         2
0  1.034041       NaN       NaN
1 -0.503624       NaN       NaN
2 -0.286119       NaN       NaN
3 -0.935605       NaN  0.221601
4  0.960638       NaN  0.385240
5 -0.150610 -0.471551 -1.108601
6 -0.323696 -0.889597  0.590986

In [59]:
df.fillna({1:0.5,2:-1})

          0         1         2
0  1.034041  0.500000 -1.000000
1 -0.503624  0.500000 -1.000000
2 -0.286119  0.500000 -1.000000
3 -0.935605  0.500000  0.221601
4  0.960638  0.500000  0.385240
5 -0.150610 -0.471551 -1.108601
6 -0.323696 -0.889597  0.590986

In [60]:
_=df.fillna(0,inplace=True)

In [61]:
df

          0         1         2
0  1.034041  0.000000  0.000000
1 -0.503624  0.000000  0.000000
2 -0.286119  0.000000  0.000000
3 -0.935605  0.000000  0.221601
4  0.960638  0.000000  0.385240
5 -0.150610 -0.471551 -1.108601
6 -0.323696 -0.889597  0.590986

In [62]:
df = DataFrame(np.random.randn(6,3))

In [63]:
df

          0         1         2
0  0.265662  0.491907  1.210736
1 -0.478481  0.314018 -0.600789
2  0.924846 -1.389955 -1.664731
3 -2.724053  1.023277 -1.285112
4  0.462859 -0.889271  0.750408
5  0.219406 -0.094142  1.562356

In [64]:
df.ix[2:,1]=NA; df.ix[4:,2]=NA

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [65]:
df

          0         1         2
0  0.265662  0.491907  1.210736
1 -0.478481  0.314018 -0.600789
2  0.924846       NaN -1.664731
3 -2.724053       NaN -1.285112
4  0.462859       NaN       NaN
5  0.219406       NaN       NaN

In [67]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.265662  0.491907  1.210736
1 -0.478481  0.314018 -0.600789
2  0.924846  0.314018 -1.664731
3 -2.724053  0.314018 -1.285112
4  0.462859       NaN -1.285112
5  0.219406       NaN -1.285112

In [68]:
data= Series([1.,NA,3.5,NA,7])

In [69]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [70]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 层次化索引

In [72]:
data = Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],
                                        [1,2,3,1,2,3,1,2,2,3]])

In [73]:
data

a  1   -0.367947
   2   -0.357565
   3   -2.575768
b  1    0.493206
   2    0.173503
   3    0.629445
c  1    0.000851
   2    0.591555
d  2   -0.561775
   3   -0.995865
dtype: float64

In [74]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [75]:
data['b']

1    0.493206
2    0.173503
3    0.629445
dtype: float64

In [76]:
data['b':'c']

b  1    0.493206
   2    0.173503
   3    0.629445
c  1    0.000851
   2    0.591555
dtype: float64

In [77]:
data.ix[['b','d']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1    0.493206
   2    0.173503
   3    0.629445
d  2   -0.561775
   3   -0.995865
dtype: float64

In [78]:
data[:,2]

a   -0.357565
b    0.173503
c    0.591555
d   -0.561775
dtype: float64

In [79]:
data.unstack()

          1         2         3
a -0.367947 -0.357565 -2.575768
b  0.493206  0.173503  0.629445
c  0.000851  0.591555       NaN
d       NaN -0.561775 -0.995865

In [80]:
data.unstack().stack()

a  1   -0.367947
   2   -0.357565
   3   -2.575768
b  1    0.493206
   2    0.173503
   3    0.629445
c  1    0.000851
   2    0.591555
d  2   -0.561775
   3   -0.995865
dtype: float64

In [81]:
frame = DataFrame(np.arange(12).reshape(4,3),
                  index=[['a','a','b','b'],[1,2,1,2]],
                 columns=[['Ohio','Ohio','Colorado'],
                         ['Green','Red','Green']])

In [82]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [83]:
frame.index.names=['key1','key2']

In [84]:
frame.columns.names=['state','color']

In [85]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [86]:
frame.columns

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [87]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [88]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [89]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [93]:
frame.sortlevel(1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [94]:
frame.swaplevel(0,1).sortlevel(0)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

# 根据级别汇总统计

In [95]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [97]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

# 使用DataFrame的列

In [99]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),
                'c':['one','one','one','two','two','two','two'],
                'd':[0,1,2,0,1,2,3]})

In [100]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [101]:
frame2 = frame.set_index(['c','d'])

In [102]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [103]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [104]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

# 整数索引

In [105]:
ser = Series(range(3),index=[-5,1,3])

In [106]:
ser

-5    0
 1    1
 3    2
dtype: int64

In [108]:
ser.iat[2]

2

In [109]:
frame = DataFrame(np.arange(6).reshape(3,2),index=[2,0,1])

In [110]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [114]:
frame.iloc[0,:]   #表示第一行（前面的0，1是列索引）

0    0
1    1
Name: 2, dtype: int32

In [119]:
!type C:/Users/zoe_x/Desktop/somedata.csv

命令语法不正确。

In [120]:
pd.read_csv('C:/Users/zoe_x/Desktop/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [121]:
pd.read_csv('C:/Users/zoe_x/Desktop/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [122]:
pd.read_csv('C:/Users/zoe_x/Desktop/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [123]:
names=['a','b','c','d','message']

In [124]:
pd.read_csv('C:/Users/zoe_x/Desktop/ex2.csv',names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12